# Intermediate SQL

## Filtering Records

#### Filtering text

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Filtering text
* Filter a pattern rather than specific text
* `LIKE`
* `NOT LIKE`
* `IN`

#### LIKE
* Used to search for a pattern in a field
- `%` match zero, one or many characters

In [3]:
sql = """
SELECT name
FROM people
WHERE name LIKE 'Ade%'
"""
run_statement(sql)

               0
0     Adel Karam
1  Adelaide Kane
2     Aden Young

- `_` match a single character

In [4]:
sql = """
SELECT name
FROM people
WHERE name LIKE 'Ev_'
"""
run_statement(sql)

     0
0  Eve

#### NOT LIKE

In [6]:
sql = """
SELECT name
FROM people
"""

run_statement(sql)

                          0
0                Anne Heche
1                Anne Meara
2            Anne Parillaud
3           Anne-Marie Duff
4     Anneliese van der Pol
...                     ...
8392          Sharat Saxena
8393           Shari Albert
8394  Shari Springer Berman
8395         Sharlto Copley
8396         Sharon Greytak

[8397 rows x 1 columns]

In [8]:
sql = """
SELECT name
FROM people
WHERE name NOT LIKE 'A.%'
"""

run_statement(sql)

                          0
0                Anne Heche
1                Anne Meara
2            Anne Parillaud
3           Anne-Marie Duff
4     Anneliese van der Pol
...                     ...
8387          Sharat Saxena
8388           Shari Albert
8389  Shari Springer Berman
8390         Sharlto Copley
8391         Sharon Greytak

[8392 rows x 1 columns]

#### Wildcard position

* names that ends with r

In [9]:
sql = """
SELECT name
FROM people
WHERE name LIKE '%r'
"""

run_statement(sql)

                      0
0          Antony Starr
1           Anupam Kher
2           Ari Graynor
3       Ariane Schluter
4            Arly Jover
..                  ...
836   Sebastian Aguilar
837  Sebastian Schipper
838         Serdar Akar
839       Shakti Kapoor
840         Shane Acker

[841 rows x 1 columns]

* names that the third character is t

In [10]:
sql = """
SELECT name
FROM people
WHERE name LIKE '__t%'
"""

run_statement(sql)

                           0
0    Anthony 'Citric' Campos
1               Anthony Bell
2            Anthony Burrell
3     Anthony Chau-Sang Wong
4            Anthony Daniels
..                       ...
451               Seth Gabel
452             Seth Gilliam
453              Seth Gordon
454          Seth MacFarlane
455              Seth Meyers

[456 rows x 1 columns]

#### WHERE, OR

In [11]:
sql = """
SELECT title
FROM films
WHERE release_year = 1920
    OR release_year = 1930
    OR release_year = 1940
"""

run_statement(sql)

                                0
0  Over the Hill to the Poorhouse
1                   Hell's Angels
2                       Boom Town
3                        Fantasia
4                       Pinocchio
5                         Rebecca
6                   The Blue Bird

#### WHERE, IN

In [14]:
sql = """
SELECT title
FROM films
WHERE release_year IN (1920, 1930, 1940)
"""

run_statement(sql)

                                0
0  Over the Hill to the Poorhouse
1                   Hell's Angels
2                       Boom Town
3                        Fantasia
4                       Pinocchio
5                         Rebecca
6                   The Blue Bird

In [15]:
sql = """
SELECT title
FROM films
WHERE country IN ('Germany', 'France')
"""

run_statement(sql)

                            0
0                      Subway
1                         JFK
2                  Metropolis
3               Pandora's Box
4                   The Train
..                        ...
245  The Transporter Refueled
246             Irreplaceable
247            The Neon Demon
248  The Purge: Election Year
249                    Carlos

[250 rows x 1 columns]